{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "<|pad|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "<|bos|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "<|eos|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "<|unk|>",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "Sequence",
    "pretokenizers": [
      {
        "type": "Split",
        "pattern": {
          "Regex": "\\\\[a-zA-Z]+"
        },
        "behavior": "Isolated",
        "invert": false
      },
      {
        "type": "ByteLevel",
        "add_prefix_space": false,
        "trim_offsets": true,
        "use_regex": true
      }
    ]
  },
  "post_processor": {
    "type": "TemplateProcessing",
    "single": [
      {
        "SpecialToken": {
          "id": "<|bos|>",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "SpecialToken": {
          "id": "<|eos|>",
          "type_id": 0
        }
      }
    ],
    "pair": [
      {
        "Sequence": {
          "id": "A",
          "type_id": 0
        }
      },
      {
        "Sequence": {
          "id": "B",
          "type_id": 1
        }
      }
    ],
    "special_tokens": {
      "<|bos|>": {
        "id": "<|bos|>",
        "ids": [
          1
        ],
        "tokens": [
          "<|bos|>"
        ]
      },
      "<|eos|>": {
        "id": "<|eos|>",
        "ids": [
          2
        ],
        "tokens": [
          "<|eos|>"
        ]
      }
    }
  },
  "decoder": {
    "type": "ByteLevel",
    "add_prefix_space": true,
    "trim_offsets": true,
    "use_regex": true
  },
  "model": {
    "type": "BPE",
    "dropout": null,
    "unk_token": "<|unk|>",
    "continuing_subword_prefix": null,
    "end_of_word_suffix": null,
    "fuse_unk": false,
    "byte_fallback": false,
    "ignore_merges": false,
    "vocab": {
      "<|pad|>": 0,
      "<|bos|>": 1,
      "<|eos|>": 2,
      "<|unk|>": 3,
      "!": 4,
      "\"": 5,
      "#": 6,
      "$": 7,
      "%": 8,
      "&": 9,
      "'": 10,
      "(": 11,
      ")": 12,
      "*": 13,
      "+": 14,
      ",": 15,
      "-": 16,
      ".": 17,
      "/": 18,
      "0": 19,
      "1": 20,
      "2": 21,
      "3": 22,
      "4": 23,
      "5": 24,
      "6": 25,
      "7": 26,
      "8": 27,
      "9": 28,
      ":": 29,
      ";": 30,
      "<": 31,
      "=": 32,
      ">": 33,
      "?": 34,
      "@": 35,
      "A": 36,
      "B": 37,
      "C": 38,
      "D": 39,
      "E": 40,
      "F": 41,
      "G": 42,
      "H": 43,
      "I": 44,
      "J": 45,
      "K": 46,
      "L": 47,
      "M": 48,
      "N": 49,
      "O": 50,
      "P": 51,
      "Q": 52,
      "R": 53,
      "S": 54,
      "T": 55,
      "U": 56,
      "V": 57,
      "W": 58,
      "X": 59,
      "Y": 60,
      "Z": 61,
      "[": 62,
      "\\": 63,
      "]": 64,
      "^": 65,
      "_": 66,
      "`": 67,
      "a": 68,
      "b": 69,
      "c": 70,
      "d": 71,
      "e": 72,
      "f": 73,
      "g": 74,
      "h": 75,
      "i": 76,
      "j": 77,
      "k": 78,
      "l": 79,
      "m": 80,
      "n": 81,
      "o": 82,
      "p": 83,
      "q": 84,
      "r": 85,
      "s": 86,
      "t": 87,
      "u": 88,
      "v": 89,
      "w": 90,
      "x": 91,
      "y": 92,
      "z": 93,
      "{": 94,
      "|": 95,
      "}": 96,
      "~": 97,
      "¡": 98,
      "¢": 99,
      "£": 100,
      "¤": 101,
      "¥": 102,
      "¦": 103,
      "§": 104,
      "¨": 105,
      "©": 106,
      "ª": 107,
      "«": 108,
      "¬": 109,
      "®": 110,
      "¯": 111,
      "°": 112,
      "±": 113,
      "²": 114,
      "³": 115,
      "´": 116,
      "µ": 117,
      "¶": 118,
      "·": 119,
      "¸": 120,
      "¹": 121,
      "º": 122,
      "»": 123,
      "¼": 124,
      "½": 125,
      "¾": 126,
      "¿": 127,
      "À": 128,
      "Á": 129,
      "Â": 130,
      "Ã": 131,
      "Ä": 132,
      "Å": 133,
      "Æ": 134,
      "Ç": 135,
      "È": 136,
      "É": 137,
      "Ê": 138,
      "Ë": 139,
      "Ì": 140,
      "Í": 141,
      "Î": 142,
      "Ï": 143,
      "Ð": 144,
      "Ñ": 145,
      "Ò": 146,
      "Ó": 147,
      "Ô": 148,
      "Õ": 149,
      "Ö": 150,
      "×": 151,
      "Ø": 152,
      "Ù": 153,
      "Ú": 154,
      "Û": 155,
      "Ü": 156,
      "Ý": 157,
      "Þ": 158,
      "ß": 159,
      "à": 160,
      "á": 161,
      "â": 162,
      "ã": 163,
      "ä": 164,
      "å": 165,
      "æ": 166,
      "ç": 167,
      "è": 168,
      "é": 169,
      "ê": 170,
      "ë": 171,
      "ì": 172,
      "í": 173,
      "î": 174,
      "ï": 175,
      "ð": 176,
      "ñ": 177,
      "ò": 178,
      "ó": 179,
      "ô": 180,
      "õ": 181,
      "ö": 182,
      "÷": 183,
      "ø": 184,
      "ù": 185,
      "ú": 186,
      "û": 187,
      "ü": 188,
      "ý": 189,
      "þ": 190,
      "ÿ": 191,
      "Ā": 192,
      "ā": 193,
      "Ă": 194,
      "ă": 195,
      "Ą": 196,
      "ą": 197,
      "Ć": 198,
      "ć": 199,
      "Ĉ": 200,
      "ĉ": 201,
      "Ċ": 202,
      "ċ": 203,
      "Č": 204,
      "č": 205,
      "Ď": 206,
      "ď": 207,
      "Đ": 208,
      "đ": 209,
      "Ē": 210,
      "ē": 211,
      "Ĕ": 212,
      "ĕ": 213,
      "Ė": 214,
      "ė": 215,
      "Ę": 216,
      "ę": 217,
      "Ě": 218,
      "ě": 219,
      "Ĝ": 220,
      "ĝ": 221,
      "Ğ": 222,
      "ğ": 223,
      "Ġ": 224,
      "ġ": 225,
      "Ģ": 226,
      "ģ": 227,
      "Ĥ": 228,
      "ĥ": 229,
      "Ħ": 230,
      "ħ": 231,
      "Ĩ": 232,
      "ĩ": 233,
      "Ī": 234,
      "ī": 235,
      "Ĭ": 236,
      "ĭ": 237,
      "Į": 238,
      "į": 239,
      "İ": 240,
      "ı": 241,
      "Ĳ": 242,
      "ĳ": 243,
      "Ĵ": 244,
      "ĵ": 245,
      "Ķ": 246,
      "ķ": 247,
      "ĸ": 248,
      "Ĺ": 249,
      "ĺ": 250,
      "Ļ": 251,
      "ļ": 252,
      "Ľ": 253,
      "ľ": 254,
      "Ŀ": 255,
      "ŀ": 256,
      "Ł": 257,
      "ł": 258,
      "Ń": 259,
      "Ġt": 260,
      "Ġa": 261,
      "he": 262,
      "Ġ1": 263,
      "on": 264,
      "ti": 265,
      "in": 266,
      "Ġ=": 267,
      "le": 268,
      "ro": 269,
      "er": 270,
      "tion": 271,
      "re": 272,
      "Ġthe": 273,
      "nd": 274,
      "ol": 275,
      "Ġ+": 276,
      "Ġ2": 277,
      "olu": 278,
      "Ġc": 279,
      "is": 280,
      "or": 281,
      "Ġb": 282,
      "ble": 283,
      "Ġp": 284,
      "Ġw": 285,
      "blem": 286,
      "roblem": 287,
      "ns": 288,
      "at": 289,
      "Ġ3": 290,
      "Ġand": 291,
      "ac": 292,
      "Ġ4": 293,
      "Problem": 294,
      "olution": 295,
      "Solution": 296,
      "Ġ6": 297,
      "Ġ5": 298,
      "wer": 299,
      "nswer": 300,
      "Answer": 301,
      "Ġis": 302,
      "ĠT": 303,
      "Ġ7": 304,
      "om": 305,
      "Ġd": 306,
      "Ġ8": 307,
      "es": 308,
      "Ġ9": 309,
      "Ġ$": 310,
      "Ġs": 311,
      "Ġo": 312,
      "Ġf": 313,
      "ĠÃ": 314,
      "ul": 315,
      "en": 316,
      "Ġof": 317,
      "ĠS": 318,
      "ri": 319,
      "Ġm": 320,
      "ing": 321,
      "Ġ(": 322,
      "te": 323,
      "al": 324,
      "ĠÃĹ": 325,
      "ĠI": 326,
      "ar": 327,
      "ace": 328,
      "Ġto": 329,
      "Ġre": 330,
      "Ġpl": 331,
      "Ġn": 332,
      "ĠIn": 333,
      "Ġby": 334,
      "an": 335,
      "Ġplace": 336,
      "pl": 337,
      "Ġ-": 338,
      "ator": 339,
      "dd": 340,
      "ed": 341,
      "Ġg": 342,
      "ĠW": 343,
      "Ġh": 344,
      "Ġwe": 345,
      "Ġle": 346,
      "ĠThe": 347,
      "rom": 348,
      "Ġe": 349,
      "Ġfrom": 350,
      "Ġ0": 351,
      "ĠA": 352,
      "et": 353,
      "ulti": 354,
      "omp": 355,
      "ĠSo": 356,
      "ft": 357,
      "hat": 358,
      "ct": 359,
      "us": 360,
      "iv": 361,
      "Ġ10": 362,
      "ute": 363,
      "um": 364,
      "Ġadd": 365,
      "ompute": 366,
      "Ġleft": 367,
      "Ġin": 368,
      "ow": 369,
      "ators": 370,
      "ĠC": 371,
      "gh": 372,
      "Ġbe": 373,
      "ĠTo": 374,
      "ultipl": 375,
      "Ġare": 376,
      "olum": 377,
      "ght": 378,
      "Ġ12": 379,
      "Ġcolum": 380,
      "Ġcolumn": 381,
      "ain": 382,
      "Ġden": 383,
      "Ġ11": 384,
      "ĠWe": 385,
      "right": 386,
      "im": 387,
      "**": 388,
      "ve": 389,
      "Ġright": 390,
      "omin": 391,
      "Ġdenomin": 392,
      "Ġrem": 393,
      "Ġon": 394,
      "Ġwor": 395,
      "Ġwork": 396,
      "rac": 397,
      "ds": 398,
      "it": 399,
      "id": 400,
      "if": 401,
      "Ġnum": 402,
      "as": 403,
      "Ġres": 404,
      "ult": 405,
      "Ġresult": 406,
      "ĠD": 407,
      "Â·": 408,
      "ĠM": 409,
      "and": 410,
      "ĠH": 411,
      "ation": 412,
      "ot": 413,
      "qu": 414,
      "ic": 415,
      "Ġman": 416,
      "uct": 417,
      "Ġmany": 418,
      "Ġnumer": 419,
      "ĠHow": 420,
      "Ġl": 421,
      "Ġremain": 422,
      "ĠE": 423,
      "eed": 424,
      "ultiply": 425,
      "ly": 426,
      "12": 427,
      "10": 428,
      "und": 429,
      "ition": 430,
      "impl": 431,
      "Ġpro": 432,
      "ub": 433,
      "ify": 434,
      "implify": 435,
      "Ġ13": 436,
      "Ġcompute": 437,
      "am": 438,
      "his": 439,
      "ry": 440,
      "Ġ14": 441,
      "ivid": 442,
      "Ġcon": 443,
      "hen": 444,
      "Ġ15": 445,
      "duct": 446,
      "ĠWhat": 447,
      "arry": 448,
      "Ġdenominators": 449,
      "Ġnumerators": 450,
      "ens": 451,
      "der": 452,
      "Ġproduct": 453,
      "ĠF": 454,
      "}$": 455,
      "Ġdivid": 456,
      "up": 457,
      "undre": 458,
      "Ġhundre": 459,
      "Ġones": 460,
      "Ġtens": 461,
      "Ġhundreds": 462,
      "Ġcom": 463,
      "Ġ16": 464,
      "ĠR": 465,
      "ach": 466,
      "ers": 467,
      "ĠCompute": 468,
      "Ġus": 469,
      "ĠAdd": 470,
      "Ġthere": 471,
      "carry": 472,
      "11": 473,
      "ou": 474,
      "Ġha": 475,
      "ĠMultiply": 476,
      "Ġpar": 477,
      "ple": 478,
      "Ġneed": 479,
      "trac": 480,
      "ubtrac": 481,
      "Ġdo": 482,
      "Ġ18": 483,
      "ĠThis": 484,
      "cd": 485,
      "Ġproblem": 486,
      "Ġbo": 487,
      "ent": 488,
      "Ġan": 489,
      "ho": 490,
      "20": 491,
      "ce": 492,
      ".**": 493,
      "ĠSimplify": 494,
      "Ġ20": 495,
      "Ġwhen": 496,
      "ind": 497,
      "Ġgiv": 498,
      "Ġ17": 499,
      "}{": 500,
      "st": 501,
      "Let": 502,
      "Ġ{": 503,
      "Ġex": 504,
      "Ġequ": 505,
      "roup": 506,
      "^{": 507,
      "ĠL": 508,
      "Ġdenominator": 509,
      "Ġcont": 510,
      "Ġremainder": 511,
      "ine": 512,
      "ay": 513,
      "Ġ19": 514,
      "18": 515,
      "row": 516,
      "Ġhave": 517,
      "Ġsubtrac": 518,
      "Ġ&": 519,
      "15": 520,
      "the": 521,
      "Ġdi": 522,
      "13": 523,
      "rib": 524,
      "Ġy": 525,
      "Ġgcd": 526,
      "16": 527,
      "ication": 528,
      "Ġco": 529,
      "ĠFind": 530,
      "}^{": 531,
      "Ġst": 532,
      "Ġ24": 533,
      "Ġcan": 534,
      "14": 535,
      "Ġgroup": 536,
      "ĠRe": 537,
      "ultiplication": 538,
      "Ġneeded": 539,
      "ribu": 540,
      "tal": 541,
      "Ġbor": 542,
      "Ġdoes": 543,
      "rowing": 544,
      "Ġborrowing": 545,
      "ate": 546,
      "ges": 547,
      "Ġaddition": 548,
      "ore": 549,
      "ong": 550,
      "Ġfor": 551,
      "Ġwhat": 552,
      "19": 553,
      "Ġor": 554,
      "$.": 555,
      "17": 556,
      "Ġmultiplication": 557,
      "Ġequal": 558,
      "Ġ30": 559,
      "ĊĊ": 560,
      "ies": 561,
      "xt": 562,
      "Ġdivide": 563,
      "ef": 564,
      "Ġyou": 565,
      "ist": 566,
      "frac": 567,
      "Ġtho": 568,
      ")/": 569,
      "il": 570,
      "Ġthat": 571,
      "tial": 572,
      "tin": 573,
      ")/(": 574,
      "ĠP": 575,
      "usand": 576,
      "Ġthousand": 577,
      "Ġ22": 578,
      "Ġthousands": 579,
      "text": 580,
      "ĠEx": 581,
      "Ġ36": 582,
      "Ġ28": 583,
      "Ġuse": 584,
      "Ġnot": 585,
      "Ġbox": 586,
      ").": 587,
      "ok": 588,
      "Ġsubtraction": 589,
      "efin": 590,
      "ir": 591,
      "Ġ27": 592,
      "Ġ40": 593,
      "Ġ25": 594,
      "rite": 595,
      "ak": 596,
      "Ġ|": 597,
      "Ġcomm": 598,
      "mat": 599,
      "Ġhas": 600,
      "Ġthen": 601,
      "to": 602,
      "Ġ23": 603,
      "Ġlea": 604,
      "ĠExp": 605,
      "Ġlong": 606,
      "Ġeach": 607,
      "The": 608,
      "Ġ60": 609,
      "Ġpartial": 610,
      "Ġcommon": 611,
      "git": 612,
      "anding": 613,
      "Ġproducts": 614,
      "Ġ26": 615,
      "Ġcomputed": 616,
      "ĠExpanding": 617,
      "ap": 618,
      "write": 619,
      "ys": 620,
      "Ġdigit": 621,
      "ting": 622,
      "ĠLC": 623,
      "ĠRewrite": 624,
      "ĠLCM": 625,
      "Ġget": 626,
      "ver": 627,
      "Ġ33": 628,
      "ith": 629,
      "Ġ35": 630,
      "Ġ48": 631,
      "Ġequals": 632,
      "Ġ32": 633,
      "_{": 634,
      "Ġ45": 635,
      "ove": 636,
      "tic": 637,
      "Ġgiving": 638,
      "ĠÃ·": 639,
      "Ġcontain": 640,
      "Ġal": 641,
      "efinition": 642,
      "os": 643,
      "âĪ": 644,
      "Ġ29": 645,
      "Ġwith": 646,
      "ction": 647,
      "end": 648,
      "Ġcomb": 649,
      "ĠEach": 650,
      "Ġ42": 651,
      "Ġ56": 652,
      "un": 653,
      "val": 654,
      "Ġ44": 655,
      "Ġcontains": 656,
      "Ġ34": 657,
      "Ġcombine": 658,
      "Ġremove": 659,
      "Ġ72": 660,
      "ence": 661,
      "Ġ50": 662,
      "ving": 663,
      "Ġ39": 664,
      "ts": 665,
      "Ġ55": 666,
      "Ġ63": 667,
      "Ġ54": 668,
      "rect": 669,
      "Ġ70": 670,
      "Ġ66": 671,
      "Ġ38": 672,
      "Ġ80": 673,
      "istribu": 674,
      "Ġlar": 675,
      "ultiple": 676,
      "Ġas": 677,
      "uc": 678,
      "Ġ37": 679,
      "24": 680,
      "Ġmultiple": 681,
      "Ġ49": 682,
      "gest": 683,
      "Ġexc": 684,
      "Ġlargest": 685,
      "Ġ\\": 686,
      "Ġ64": 687,
      "rectly": 688,
      "ut": 689,
      "Ġleaving": 690,
      "Ġexceed": 691,
      "Ġtotal": 692,
      "Ġ21": 693,
      "Ġexceeding": 694,
      "30": 695,
      "Ġ77": 696,
      "Ġ90": 697,
      "valu": 698,
      "ingle": 699,
      "Ġ57": 700,
      "Ġsingle": 701,
      "Ġ84": 702,
      "Ġ46": 703,
      "Ġmultiply": 704,
      "ĠIf": 705,
      "Ġ65": 706,
      "se": 707,
      "ra": 708,
      "ĠDistribu": 709,
      "cul": 710,
      "Ġ47": 711,
      "Ġ43": 712,
      "Ġ68": 713,
      "alcul": 714,
      "Ġ75": 715,
      "Ġgroups": 716,
      "are": 717,
      "Ġ59": 718,
      "Ġ78": 719,
      "ĠDistributing": 720,
      "Ġ88": 721,
      "Ġ69": 722,
      "Ġ58": 723,
      "Ġap": 724,
      "Ġ67": 725,
      "ĠÂ·": 726,
      "Ġ76": 727,
      "Ġsum": 728,
      "Ġ52": 729,
      "Ġ*": 730,
      "$,": 731,
      "Ġ53": 732,
      "Ġ74": 733,
      "Ġsimplify": 734,
      "Ġ79": 735,
      "alculate": 736,
      "##": 737,
      "Ġ96": 738,
      "tes": 739,
      "Ġ99": 740,
      "Ġinto": 741,
      "Ġtak": 742,
      "ĠCalculate": 743,
      "per": 744,
      "olle": 745,
      "Ġ73": 746,
      "ples": 747,
      "ere": 748,
      "Ġgives": 749,
      "Ġ85": 750,
      "Ġ62": 751,
      "ĠĊ": 752,
      "ps": 753,
      "str": 754,
      "ag": 755,
      "ec": 756,
      "Ġcolle": 757,
      "ted": 758,
      "ĠTotal": 759,
      "rix": 760,
      "âĪĴ": 761,
      "uch": 762,
      "day": 763,
      "Ġcontribu": 764,
      "}_{": 765,
      "enc": 766,
      "Ġ95": 767,
      "Ġcontributes": 768,
      "Ġwere": 769,
      "Ġthem": 770,
      "Ġ89": 771,
      "Ġnumerator": 772,
      "Ġ86": 773,
      "Ġcar": 774,
      "Ġtim": 775,
      "Ġ98": 776,
      "bles": 777,
      "Ġ87": 778,
      "orem": 779,
      "ĠJ": 780,
      "Ġdividing": 781,
      "36": 782,
      "fer": 783,
      "ion": 784,
      "Ġall": 785,
      "Ġ\\\\": 786,
      "40": 787,
      "de": 788,
      "Ġ97": 789,
      "struct": 790,
      "irst": 791,
      "Ġer": 792,
      "Ġnumb": 793,
      "unction": 794,
      "Ġbook": 795,
      "ins": 796,
      "Ġcards": 797,
      "Ġmar": 798,
      "tive": 799,
      "anges": 800,
      "ĠPro": 801,
      "Ġbooks": 802,
      "Ġcook": 803,
      "Ġ94": 804,
      "Ġcookies": 805,
      "int": 806,
      "Ġat": 807,
      "tick": 808,
      "Ġtoys": 809,
      "her": 810,
      "Ġstick": 811,
      "ils": 812,
      "amps": 813,
      "Ġstickers": 814,
      "Ġstamps": 815,
      "Ġ83": 816,
      "Ġcand": 817,
      "Ġit": 818,
      "Ġoranges": 819,
      "ads": 820,
      "Ġcoins": 821,
      "Ġapples": 822,
      "Ġcandies": 823,
      "Ġeras": 824,
      "Ġerasers": 825,
      "Ġfirst": 826,
      "Ġmarbles": 827,
      "Ġpenc": 828,
      "Ġ82": 829,
      "Ġbeads": 830,
      "Ġpencils": 831,
      "60": 832,
      "Ġtimes": 833,
      "of": 834,
      "eg": 835,
      "pace": 836,
      "Ġ93": 837,
      "Ġfri": 838,
      "ations": 839,
      "Ġfriend": 840,
      "orm": 841,
      "Ġ92": 842,
      "ĠN": 843,
      "ie": 844,
      "iffer": 845,
      "ven": 846,
      "ta": 847,
      "ur": 848,
      "ig": 849,
      "math": 850,
      "matrix": 851,
      "Ġqu": 852,
      "act": 853,
      "Ġdiffer": 854,
      "ge": 855,
      ")$": 856,
      "ĠDefinition": 857,
      "Then": 858,
      "Ġsh": 859,
      "Theorem": 860,
      "Ġ31": 861,
      "Ġpo": 862,
      "art": 863,
      "Ġeven": 864,
      "res": 865,
      "ĠDi": 866,
      "Ġvalu": 867,
      "00": 868,
      "Ġx": 869,
      "ment": 870,
      "Ġset": 871,
      "Ġdirectly": 872,
      ")?": 873,
      "Ġorder": 874,
      "map": 875,
      "}+": 876,
      "Ġr": 877,
      "âĢ": 878,
      "28": 879,
      "mathb": 880,
      "Ġmore": 881,
      "ter": 882,
      "ase": 883,
      "Ġse": 884,
      "oth": 885,
      "Ġfunction": 886,
      "ph": 887,
      "oti": 888,
      "Ġ41": 889,
      "lex": 890,
      "og": 891,
      "Ġ${": 892,
      "sq": 893,
      "ĠAdding": 894,
      "Ġ51": 895,
      "vect": 896,
      "th": 897,
      "Ġsubtract": 898,
      "$$": 899,
      "low": 900,
      "very": 901,
      "Ġused": 902,
      "Ġhow": 903,
      "ĠB": 904,
      "cl": 905,
      "Ġevenly": 906,
      "set": 907,
      "ĠDirectly": 908,
      "Ġpart": 909,
      "Ġmin": 910,
      "Ġboth": 911,
      "ĠProof": 912,
      "Ġnumber": 913,
      "Ġout": 914,
      "ĠAn": 915,
      "Ġth": 916,
      "Ġstart": 917,
      "ord": 918,
      "Ġplus": 919,
      "inal": 920,
      "Ġbas": 921,
      "Ġ61": 922,
      "otient": 923,
      "Ġthis": 924,
      "Ġparts": 925,
      "rt": 926,
      "ity": 927,
      "way": 928,
      "72": 929,
      "Ġdifference": 930,
      "Ġgets": 931,
      "Ġ71": 932,
      "Ġnow": 933,
      "Ġam": 934,
      "ile": 935,
      "22": 936,
      "fore": 937,
      "Ġtake": 938,
      ")=": 939,
      "Ġhad": 940,
      "erm": 941,
      "Ġvalue": 942,
      "sqrt": 943,
      ".$": 944,
      "cted": 945,
      "ample": 946,
      "Ġwh": 947,
      "Ġmuch": 948,
      "gle": 949,
      "}}": 950,
      "Ġquotient": 951,
      "ĠQ": 952,
      "ollow": 953,
      "56": 954,
      "Ġusing": 955,
      "other": 956,
      "ĠG": 957,
      "Ġv": 958,
      "mathbf": 959,
      "90": 960,
      "Ġ81": 961,
      "ding": 962,
      "70": 963,
      "ĠThere": 964,
      "Ġfollow": 965,
      "ich": 966,
      "Ġdid": 967,
      "55": 968,
      "Ġbu": 969,
      "âĵ": 970,
      "tions": 971,
      "ket": 972,
      "ubtract": 973,
      "35": 974,
      "cdot": 975,
      "Ġbag": 976,
      "Ġaway": 977,
      "ĠMon": 978,
      "ĠLe": 979,
      "ues": 980,
      "45": 981,
      "ma": 982,
      "Ġbec": 983,
      "lar": 984,
      "Ġoper": 985,
      "ĠThen": 986,
      "Definition": 987,
      "ĠSubtract": 988,
      "irc": 989,
      "Ġminus": 990,
      "ĠQu": 991,
      "44": 992,
      "ical": 993,
      "33": 994,
      "Ġfrac": 995,
      "Ġcollect": 996,
      "Ġcollected": 997,
      "ĠMonday": 998,
      "Ġform": 999,
      "uesday": 1000,
      "ĠTuesday": 1001,
      "ill": 1002,
      "Ġamong": 1003,
      "ari": 1004,
      "inn": 1005,
      "88": 1006,
      "so": 1007,
      "Ġspace": 1008,
      "Ġboxes": 1009,
      "21": 1010,
      "Ġbuys": 1011,
      "84": 1012,
      "25": 1013,
      "Ġ.": 1014,
      "teg": 1015,
      "Ġwhich": 1016,
      "Ġ91": 1017,
      "Ex": 1018,
      "ad": 1019,
      "Ġcomp": 1020,
      "Ġtaken": 1021,
      "66": 1022,
      "99": 1023,
      "ĠAnother": 1024,
      "Ġline": 1025,
      "}=": 1026,
      "42": 1027,
      "wo": 1028,
      "Ġsub": 1029,
      "ĠDo": 1030,
      "Ġ$(": 1031,
      "__": 1032,
      "}-": 1033,
      "ure": 1034,
      "ĠLeft": 1035,
      "Ġwan": 1036,
      "Ġbasket": 1037,
      "lor": 1038,
      "Ġk": 1039,
      "Ġsol": 1040,
      "77": 1041,
      "here": 1042,
      "valuate": 1043,
      "ĠO": 1044,
      "omes": 1045,
      "gan": 1046,
      "Ġme": 1047,
      "ĠMor": 1048,
      "Ġfractions": 1049,
      "ite": 1050,
      "80": 1051,
      "able": 1052,
      "aylor": 1053,
      "quence": 1054,
      "ky": 1055,
      "ĠTaylor": 1056,
      "ĠCase": 1057,
      "lement": 1058,
      "ĠCon": 1059,
      "egin": 1060,
      "ĠAlex": 1061,
      "ĠMorgan": 1062,
      "Ġbefore": 1063,
      "ota": 1064,
      "Ġfinal": 1065,
      "rew": 1066,
      "ric": 1067,
      "begin": 1068,
      "ĠQuinn": 1069,
      "ordan": 1070,
      "Ġmultiplications": 1071,
      "63": 1072,
      "ĠSam": 1073,
      "ĠU": 1074,
      "ĠJordan": 1075,
      "ect": 1076,
      "eron": 1077,
      "ĠSky": 1078,
      "ĠSkylar": 1079,
      "Ġleading": 1080,
      "Ġbecomes": 1081,
      "tim": 1082,
      "ĠCasey": 1083,
      "ĠCam": 1084,
      "ĠDrew": 1085,
      "ĠCameron": 1086,
      "}(": 1087,
      "ĠDak": 1088,
      "Ġoperations": 1089,
      "ĠDakota": 1090,
      "ĠRile": 1091,
      "ĠRiley": 1092,
      "ese": 1093,
      "ĠAvery": 1094,
      "Ġwants": 1095,
      "Ġcarry": 1096,
      "rap": 1097,
      "ĠJam": 1098,
      "Ġshare": 1099,
      "ame": 1100,
      "ĠJamie": 1101,
      "ote": 1102,
      "Ġ:": 1103,
      "32": 1104,
      "Ġsuch": 1105,
      "Ġâĵ": 1106,
      "Ġequally": 1107,
      "ĠReese": 1108,
      "Ġfriends": 1109,
      "Ġ100": 1110,
      "Ġun": 1111,
      "our": 1112,
      "ty": 1113,
      ",$": 1114,
      "ld": 1115,
      "ud": 1116,
      "Ġtwo": 1117,
      "raph": 1118,
      "Ġone": 1119,
      "ll": 1120,
      "ous": 1121,
      "ince": 1122,
      "vers": 1123,
      "ial": 1124,
      "ude": 1125,
      "Ġ120": 1126,
      "vector": 1127,
      "ĠEvaluate": 1128,
      "erc": 1129,
      "}}{": 1130,
      "ative": 1131,
      "50": 1132,
      "Ġwill": 1133,
      "Ġgo": 1134,
      "ivis": 1135,
      "Ġ**": 1136,
      "Ġ110": 1137,
      "ary": 1138,
      "od": 1139,
      "aren": 1140,
      "times": 1141,
      "pres": 1142,
      "48": 1143,
      "pha": 1144,
      "clude": 1145,
      "Ġinteg": 1146,
      "pos": 1147,
      "ide": 1148,
      "ze": 1149,
      "}$.": 1150,
      "own": 1151,
      "27": 1152,
      "Ġmat": 1153,
      "alpha": 1154,
      "Ġfollowing": 1155,
      "angle": 1156,
      "64": 1157,
      "me": 1158,
      "ight": 1159,
      "circ": 1160,
      "olog": 1161,
      "ome": 1162,
      "ant": 1163,
      "Ġpoint": 1164,
      "Ġdivided": 1165,
      "Ġif": 1166,
      "ivide": 1167,
      "96": 1168,
      "75": 1169,
      "pi": 1170,
      "Ġ108": 1171,
      "Ġcl": 1172,
      "Ġcost": 1173,
      "38": 1174,
      "Ġequation": 1175,
      "ab": 1176,
      "ĠâĪ": 1177,
      "26": 1178,
      "34": 1179,
      "oun": 1180,
      "app": 1181,
      "ĠâĪİ": 1182,
      "est": 1183,
      "Ġhol": 1184,
      "quare": 1185,
      "ĠDivide": 1186,
      "ĠV": 1187,
      "Ġ\\,": 1188,
      "all": 1189,
      "ses": 1190,
      "Ġdefinition": 1191,
      "enti": 1192,
      "polog": 1193,
      "})": 1194,
      "Ġnumbers": 1195,
      "ree": 1196,
      "76": 1197,
      "inite": 1198,
      "only": 1199,
      "Ġsp": 1200,
      "ots": 1201,
      "ercis": 1202,
      "include": 1203,
      "onlyinclude": 1204,
      "Ġvector": 1205,
      "rans": 1206,
      "Ġab": 1207,
      "ivision": 1208,
      "},": 1209,
      "ents": 1210,
      "We": 1211,
      "In": 1212,
      "ther": 1213,
      "Ġinter": 1214,
      "Ġpos": 1215,
      "Ġelement": 1216,
      "Ġkn": 1217,
      "Ġgraph": 1218,
      "\\\\": 1219,
      "95": 1220,
      "em": 1221,
      "etric": 1222,
      "Ġso": 1223,
      "osed": 1224,
      "Ġ,": 1225,
      "Ġholds": 1226,
      "alle": 1227,
      "Ġreal": 1228,
      "efined": 1229,
      "Ġvari": 1230,
      "tau": 1231,
      "ular": 1232,
      "Ġsold": 1233,
      "oc": 1234,
      "Example": 1235,
      "ated": 1236,
      "Ġ132": 1237,
      "54": 1238,
      "pen": 1239,
      "68": 1240,
      "itive": 1241,
      "Ġterm": 1242,
      "39": 1243,
      "Ġexact": 1244,
      "Ġstud": 1245,
      "52": 1246,
      "sub": 1247,
      "tinu": 1248,
      "ess": 1249,
      "$-": 1250,
      "57": 1251,
      "pro": 1252,
      "ne": 1253,
      "Ġbags": 1254,
      "####": 1255,
      "Ġfind": 1256,
      "theta": 1257,
      "pe": 1258,
      "ast": 1259,
      "cc": 1260,
      "ĠSpace": 1261,
      "65": 1262,
      "Ġpri": 1263,
      "Ġexactly": 1264,
      "Ġover": 1265,
      "Ġthan": 1266,
      "sin": 1267,
      "ĠSince": 1268,
      "Ġch": 1269,
      "ass": 1270,
      "geb": 1271,
      "age": 1272,
      "49": 1273,
      "apping": 1274,
      "23": 1275,
      "Ġwhere": 1276,
      "78": 1277,
      "Ġalso": 1278,
      "98": 1279,
      "omial": 1280,
      "51": 1281,
      "ard": 1282,
      "Ġdefined": 1283,
      "umb": 1284,
      "ust": 1285,
      "{{": 1286,
      "gebra": 1287,
      "85": 1288,
      "ĠX": 1289,
      "Ġ112": 1290,
      "110": 1291,
      "cos": 1292,
      "ener": 1293,
      "From": 1294,
      "Ġsame": 1295,
      "29": 1296,
      "unders": 1297,
      "uld": 1298,
      "igma": 1299,
      "132": 1300,
      "Ġ144": 1301,
      "100": 1302,
      "Ġ126": 1303,
      "ĠMultiplication": 1304,
      "\\,": 1305,
      "ive": 1306,
      "Ġwho": 1307,
      "Ġne": 1308,
      "92": 1309,
      "form": 1310,
      "Ġsolution": 1311,
      "pre": 1312,
      "ale": 1313,
      "ĠDivision": 1314,
      "el": 1315,
      "phis": 1316,
      "91": 1317,
      "ally": 1318,
      "phism": 1319,
      "Ġ140": 1320,
      "Ġhe": 1321,
      "omor": 1322,
      "}_": 1323,
      "Ġper": 1324,
      "ĊĊĠ": 1325,
      "37": 1326,
      "ch": 1327,
      "'s": 1328,
      "ĠComp": 1329,
      "tem": 1330,
      "Ġ104": 1331,
      "58": 1332,
      "74": 1333,
      "arenthe": 1334,
      "actor": 1335,
      "81": 1336,
      "ci": 1337,
      "teq": 1338,
      "seteq": 1339,
      "Ġsquare": 1340,
      "sum": 1341,
      "arentheses": 1342,
      "Ġdis": 1343,
      "Ġrel": 1344,
      "Ġ180": 1345,
      "By": 1346,
      "we": 1347,
      "Ġ105": 1348,
      "ang": 1349,
      "Ġgiven": 1350,
      "Ġlinear": 1351,
      "subseteq": 1352,
      "86": 1353,
      "94": 1354,
      "31": 1355,
      "tinuous": 1356,
      "ercises": 1357,
      "Ġwas": 1358,
      "97": 1359,
      "underset": 1360,
      "phi": 1361,
      "ian": 1362,
      ")}^{": 1363,
      "ystem": 1364,
      "hop": 1365,
      "zero": 1366,
      "ati": 1367,
      "ym": 1368,
      "oly": 1369,
      "ĠFunction": 1370,
      "62": 1371,
      "ĠParentheses": 1372,
      "Ġtopolog": 1373,
      "ection": 1374,
      "pose": 1375,
      "73": 1376,
      "Ġbet": 1377,
      "mathop": 1378,
      "riangle": 1379,
      "press": 1380,
      "ield": 1381,
      "pend": 1382,
      "46": 1383,
      "ween": 1384,
      "79": 1385,
      "sequence": 1386,
      "ign": 1387,
      "Ġits": 1388,
      "82": 1389,
      "Ġ130": 1390,
      "71": 1391,
      "ance": 1392,
      "ĠSet": 1393,
      "amples": 1394,
      "ule": 1395,
      "}}$": 1396,
      "ĠNumb": 1397,
      "Ġany": 1398,
      "89": 1399,
      "Ġknown": 1400,
      "Ġexpress": 1401,
      "iz": 1402,
      "ists": 1403,
      "69": 1404,
      "ound": 1405,
      "ĠEqu": 1406,
      "Ġro": 1407,
      "ng": 1408,
      "rad": 1409,
      "83": 1410,
      "Ġde": 1411,
      "Ġma": 1412,
      "px": 1413,
      "59": 1414,
      "ral": 1415,
      "ue": 1416,
      "Ġexercises": 1417,
      "Ġbetween": 1418,
      "87": 1419,
      "ĠSub": 1420,
      "41": 1421,
      "ational": 1422,
      "53": 1423,
      "47": 1424,
      "ves": 1425,
      "Ġ150": 1426,
      "Ġno": 1427,
      "Ġj": 1428,
      "ĠAl": 1429,
      "67": 1430,
      "93": 1431,
      "____": 1432,
      "43": 1433,
      "ans": 1434,
      "{(": 1435,
      "Ġob": 1436,
      "Ġmo": 1437,
      "Ġsequence": 1438,
      "aus": 1439,
      "Ġdenote": 1440,
      "Ġfollows": 1441,
      "Ġother": 1442,
      "out": 1443,
      "cep": 1444,
      "Ġ160": 1445,
      "Ġ117": 1446,
      "Ġmatrix": 1447,
      "Ġsome": 1448,
      "Ġ102": 1449,
      "ldots": 1450,
      "61": 1451,
      "omorphism": 1452,
      "ints": 1453,
      "Ġar": 1454,
      "overs": 1455,
      "ake": 1456,
      "ane": 1457,
      "sid": 1458,
      "ĠNote": 1459,
      "uppose": 1460,
      "overset": 1461,
      "eterm": 1462,
      "uple": 1463,
      "ĊĊĠĊ": 1464,
      "ond": 1465,
      "ory": 1466,
      "ĠâĵĲ": 1467,
      "ility": 1468,
      "For": 1469,
      "Ġ240": 1470,
      "Ġund": 1471,
      "Ġtrans": 1472,
      ")(": 1473,
      "ĠCl": 1474,
      "ss": 1475,
      "ĠUn": 1476,
      "verse": 1477,
      "Ġ119": 1478,
      "âĢĻ": 1479,
      "Ġnorm": 1480,
      "Ġmapping": 1481,
      "ower": 1482,
      "Ġdec": 1483,
      "Ġangle": 1484,
      "red": 1485,
      "Ġver": 1486,
      "Ġsystem": 1487,
      "sider": 1488,
      "fic": 1489,
      "{âĪĴ": 1490,
      "ĠSe": 1491,
      "nomial": 1492,
      "par": 1493,
      "ĠK": 1494,
      "olynomial": 1495,
      "tuple": 1496,
      "Ġfunctions": 1497,
      "Ġgener": 1498,
      "Ġprime": 1499,
      "Ġâĵĳ": 1500,
      "Ġnon": 1501,
      "ĠSt": 1502,
      "Ġ121": 1503,
      "Ġzero": 1504,
      "ack": 1505,
      "norm": 1506,
      "alen": 1507,
      "Ġsubset": 1508,
      "Ġ114": 1509,
      "}.$": 1510,
      "Ġte": 1511,
      "ates": 1512,
      "tical": 1513,
      "Ġwhose": 1514,
      "05": 1515,
      "04": 1516,
      "ivalen": 1517,
      "ĠTheorem": 1518,
      "line": 1519,
      "Ġbut": 1520,
      "Ġind": 1521,
      "$:": 1522,
      "*.": 1523,
      "si": 1524,
      "xim": 1525,
      "Ġtr": 1526,
      "cre": 1527,
      "08": 1528,
      "eta": 1529,
      "Ġ128": 1530,
      "Ġup": 1531,
      "Ġ135": 1532,
      "Ġexample": 1533,
      "Ġunit": 1534,
      "ĉĉ": 1535,
      "Ġinterval": 1536,
      "Ġunder": 1537,
      "âĪŀ": 1538,
      "Pro": 1539,
      "Ġring": 1540,
      "ties": 1541,
      "Hence": 1542,
      "ula": 1543,
      "Ġlet": 1544,
      "Ġ####": 1545,
      "quad": 1546,
      "ability": 1547,
      "Ġmeas": 1548,
      "01": 1549,
      "Ġfactor": 1550,
      "ential": 1551,
      "This": 1552,
      "Ġopen": 1553,
      "Ġevery": 1554,
      "({": 1555,
      "Ġbound": 1556,
      "Ġpositive": 1557,
      "Ġmean": 1558,
      "Ġonly": 1559,
      "ise": 1560,
      "pon": 1561,
      "omain": 1562,
      "oint": 1563,
      "ange": 1564,
      "Ġ\"": 1565,
      "lo": 1566,
      "ngth": 1567,
      "vi": 1568,
      "###": 1569,
      "amb": 1570,
      "Ġ}": 1571,
      "hes": 1572,
      "*-": 1573,
      "Ġsm": 1574,
      "dfrac": 1575,
      "Ġim": 1576,
      "Ġexists": 1577,
      "06": 1578,
      "Ġcirc": 1579,
      "paren": 1580,
      "da": 1581,
      "Ġsec": 1582,
      "yp": 1583,
      "ters": 1584,
      "Ġfinite": 1585,
      "Ġfield": 1586,
      "orical": 1587,
      "ĠSolution": 1588,
      "les": 1589,
      "Ġid": 1590,
      "Ġrepres": 1591,
      "Ġ$âĪĴ": 1592,
      "ambda": 1593,
      "Ġequations": 1594,
      "02": 1595,
      "ective": 1596,
      "Ġpoints": 1597,
      "ater": 1598,
      "imit": 1599,
      "Ġlength": 1600,
      "Ġvalues": 1601,
      "Con": 1602,
      "formation": 1603,
      "mathbb": 1604,
      "07": 1605,
      "rder": 1606,
      "It": 1607,
      "Ġ133": 1608,
      "ear": 1609,
      "Al": 1610,
      "ram": 1611,
      "Ġ136": 1612,
      "09": 1613,
      "group": 1614,
      "ĠY": 1615,
      "aces": 1616,
      "}+{": 1617,
      "Ġ168": 1618,
      "bability": 1619,
      "ck": 1620,
      "Ġproper": 1621,
      "Ġ107": 1622,
      "ject": 1623,
      "âĢ²": 1624,
      "),": 1625,
      "fter": 1626,
      "Ġterms": 1627,
      "por": 1628,
      "Ġ220": 1629,
      "ĠFor": 1630,
      "03": 1631,
      "Ġshow": 1632,
      "Ġtime": 1633,
      "Ġ101": 1634,
      "Ġ154": 1635,
      "dition": 1636,
      "Ġtopological": 1637,
      "Ġdistribu": 1638,
      "Ġ216": 1639,
      "fici": 1640,
      "Ġ103": 1641,
      "120": 1642,
      "one": 1643,
      "Ġthese": 1644,
      "âĢĵ": 1645,
      "Ġ106": 1646,
      "Ġconver": 1647,
      "ces": 1648,
      "Ġcontinuous": 1649,
      "tep": 1650,
      "hus": 1651,
      "Ġthree": 1652,
      "ulation": 1653,
      "xis": 1654,
      "Ġ210": 1655,
      "ual": 1656,
      "Ġ143": 1657,
      "eries": 1658,
      "Ġ115": 1659,
      "Ġstudents": 1660,
      "Ġidenti": 1661,
      "andard": 1662,
      "Ġclosed": 1663,
      "Ġmet": 1664,
      "iqu": 1665,
      "ould": 1666,
      "Ġyour": 1667,
      "uction": 1668,
      "ected": 1669,
      "Ġvariable": 1670,
      "xi": 1671,
      "Ġrad": 1672,
      "Ġexpression": 1673,
      "ĠâĪĴ": 1674,
      "istorical": 1675,
      "Ġalgebra": 1676,
      "Ġmay": 1677,
      "Ġinde": 1678,
      "lim": 1679,
      "heck": 1680,
      "Ġdeterm": 1681,
      "sing": 1682,
      "Ġappl": 1683,
      "RR": 1684,
      "Ġpolynomial": 1685,
      "Ġwould": 1686,
      "ĠInteg": 1687,
      "Ġreg": 1688,
      "ĠLine": 1689,
      "ĠZ": 1690,
      "ount": 1691,
      "Ġ116": 1692,
      "Ġelements": 1693,
      "Ġmust": 1694,
      "atis": 1695,
      "lete": 1696,
      "lambda": 1697,
      "Ġ113": 1698,
      "Ġ176": 1699,
      "Ġ109": 1700,
      "=âĪĴ": 1701,
      "ceq": 1702,
      "Ġsets": 1703,
      "enter": 1704,
      "ied": 1705,
      "Ġpre": 1706,
      "Historical": 1707,
      "air": 1708,
      "beta": 1709,
      "ke": 1710,
      "del": 1711,
      "ounta": 1712,
      "Proof": 1713,
      ").$": 1714,
      "Ġprobability": 1715,
      "ause": 1716,
      "bmatrix": 1717,
      "ĠGroup": 1718,
      "Ġ153": 1719,
      "Ġ156": 1720,
      "Ġappro": 1721,
      "ip": 1722,
      "ateg": 1723,
      "Ġthey": 1724,
      "Ġ{\\,": 1725,
      "Sigma": 1726,
      "Ġ198": 1727,
      "tit": 1728,
      "Ġcor": 1729,
      "Ġstr": 1730,
      "ever": 1731,
      "jection": 1732,
      "ating": 1733,
      "ides": 1734,
      "mu": 1735,
      "Ġsc": 1736,
      "Ġ124": 1737,
      "Examples": 1738,
      "Ġ162": 1739,
      "000": 1740,
      "bol": 1741,
      "Ġcur": 1742,
      "Ġ165": 1743,
      "Ġfe": 1744,
      "There": 1745,
      "imal": 1746,
      "Ġsym": 1747,
      "Ġsur": 1748,
      "Ġ152": 1749,
      "âĮ": 1750,
      "Ġmade": 1751,
      "Ġ320": 1752,
      "{/": 1753,
      "$(": 1754,
      "for": 1755,
      "ables": 1756,
      "ook": 1757,
      "stant": 1758,
      "Ġformula": 1759,
      "preceq": 1760,
      "Ġarea": 1761,
      "sigma": 1762,
      "ata": 1763,
      "br": 1764,
      "ĠForm": 1765,
      "Ġabout": 1766,
      "Ġ123": 1767,
      "If": 1768,
      "):": 1769,
      "hed": 1770,
      "cept": 1771,
      "ĠLet": 1772,
      "ordin": 1773,
      "Ġordered": 1774,
      "Ġstandard": 1775,
      "alled": 1776,
      "Ġdistribution": 1777,
      "Ġrelation": 1778,
      "Ġ125": 1779,
      "Ġintegral": 1780,
      "Ġ118": 1781,
      "&=": 1782,
      "Ġ<": 1783,
      "Thus": 1784,
      "ten": 1785,
      "ĠProduct": 1786,
      "Ġcalled": 1787,
      "180": 1788,
      "egative": 1789,
      "Ġside": 1790,
      "So": 1791,
      "Ġplane": 1792,
      "That": 1793,
      "Ġ200": 1794,
      "Ġinf": 1795,
      "eriv": 1796,
      "pendent": 1797,
      "Ġrow": 1798,
      "Ġsim": 1799,
      "Ġmeans": 1800,
      "igh": 1801,
      "Ġ300": 1802,
      "vel": 1803,
      "Ġsolve": 1804,
      "Ġinteger": 1805,
      "}^{âĢ²": 1806,
      "ĠNumber": 1807,
      "ily": 1808,
      "Ġsecond": 1809,
      "log": 1810,
      "Ġ192": 1811,
      "equ": 1812,
      "atur": 1813,
      "Ġafter": 1814,
      "Ġ111": 1815,
      "ĠReal": 1816,
      "olve": 1817,
      "Ġintegers": 1818,
      "Ġ127": 1819,
      "ither": 1820,
      "ff": 1821,
      "}{{": 1822,
      "Ġ360": 1823,
      "Ġ252": 1824,
      "Ġmeasure": 1825,
      "ĠOrder": 1826,
      "Ġresp": 1827,
      "con": 1828,
      "ull": 1829,
      "Ġtriangle": 1830,
      "Ġ171": 1831,
      "rou": 1832,
      "ines": 1833,
      "*(": 1834,
      "ector": 1835,
      "ĠMat": 1836,
      "Ġstudent": 1837,
      "xiom": 1838,
      "stit": 1839,
      "Ġway": 1840,
      "Ġstate": 1841,
      "sqbr": 1842,
      "sqbrk": 1843,
      "Ġrece": 1844,
      "Ġ170": 1845,
      "zz": 1846,
      "Ġdist": 1847,
      "Ġ122": 1848,
      "tain": 1849,
      "Ġyear": 1850,
      "ix": 1851,
      "Ġlog": 1852,
      "Ġloc": 1853,
      "Ġdomain": 1854,
      "ccur": 1855,
      "ases": 1856,
      "^{-": 1857,
      "sc": 1858,
      "ĠCh": 1859,
      ")+": 1860,
      "Ġdifferent": 1861,
      "ey": 1862,
      "uzz": 1863,
      "Ġtheir": 1864,
      "ficient": 1865,
      "left": 1866,
      "Ġanswer": 1867,
      "dx": 1868,
      "Ġtri": 1869,
      "nected": 1870,
      "Ġ}$": 1871,
      "(âĪĴ": 1872,
      "tice": 1873,
      "Ġ>": 1874,
      "rict": 1875,
      "144": 1876,
      "Ġpop": 1877,
      "ĠProper": 1878,
      "ice": 1879,
      "{âĪĴ}": 1880,
      "Ġdes": 1881,
      "{/}": 1882,
      "rough": 1883,
      "ike": 1884,
      "ension": 1885,
      "Suppose": 1886,
      "ecess": 1887,
      "Ġcase": 1888,
      "AB": 1889,
      "Ġpower": 1890,
      "Ġdata": 1891,
      "ĠNumbers": 1892,
      "ug": 1893,
      "imension": 1894,
      "andom": 1895,
      "Ġ204": 1896,
      "Ġ138": 1897,
      "Ġcircle": 1898,
      "Ġhis": 1899,
      "})$": 1900,
      "Ġseries": 1901,
      "sible": 1902,
      "Ġwrite": 1903,
      "perator": 1904,
      "where": 1905,
      "ours": 1906,
      ")={": 1907,
      "Ġ288": 1908,
      "raight": 1909,
      "ometric": 1910,
      "Ġ129": 1911,
      "})}^{": 1912,
      "ique": 1913,
      "Also": 1914,
      "Ġ134": 1915,
      "Ġ187": 1916,
      "uced": 1917,
      "Ġsides": 1918,
      "Ġ190": 1919,
      "Simplify": 1920,
      "Ġ270": 1921,
      "Ġsample": 1922,
      "atural": 1923,
      "Ġorig": 1924,
      "bit": 1925,
      "Ġsee": 1926,
      "}^": 1927,
      "Ġcomplex": 1928,
      "Ġdivides": 1929,
      "ypot": 1930,
      "Ġad": 1931,
      "Ġconsider": 1932,
      "FF": 1933,
      "Ġ182": 1934,
      "Ġpair": 1935,
      "rable": 1936,
      "ved": 1937,
      "Ġtest": 1938,
      "ln": 1939,
      "Ġ209": 1940,
      "ĊĊĠĊĠĊ": 1941,
      "Ġ131": 1942,
      "Ġrational": 1943,
      "Ġlimit": 1944,
      "Ġknow": 1945,
      "Ġthrough": 1946,
      "Ġ147": 1947,
      "name": 1948,
      "Ġ208": 1949,
      "Ġz": 1950,
      "ercise": 1951,
      ",âĪĴ": 1952,
      "op": 1953,
      "rin": 1954,
      "Ġ420": 1955,
      "eq": 1956,
      "ountable": 1957,
      "ize": 1958,
      "},$": 1959,
      "Ġ224": 1960,
      "ĠTopolog": 1961,
      "Ġpack": 1962,
      "Ġrefer": 1963,
      "Ġ280": 1964,
      "Ġ$-": 1965,
      "ences": 1966,
      "lation": 1967,
      "ĠTrans": 1968,
      "Ġ137": 1969,
      "gon": 1970,
      "lope": 1971,
      "Ġequivalen": 1972,
      "Ġtrue": 1973,
      "ĊĠĊ": 1974,
      "ber": 1975,
      "ega": 1976,
      "CC": 1977,
      "Ġsection": 1978,
      "ress": 1979,
      "amily": 1980,
      "={": 1981,
      "-{": 1982,
      "pty": 1983,
      "Ġ228": 1984,
      "ex": 1985,
      "fty": 1986,
      "Ġconstant": 1987,
      "ĠAlso": 1988,
      "Ġexpon": 1989,
      "ĠElement": 1990,
      "fy": 1991,
      "Ġmake": 1992,
      "Ġ234": 1993,
      "efine": 1994,
      "Â°": 1995,
      "Step": 1996,
      "Ġidentity": 1997,
      "Ġpopulation": 1998,
      "Ġ255": 1999,
      "Ġi": 2000,
      "amma": 2001,
      "Ġ195": 2002,
      "140": 2003,
      "Ġdeg": 2004,
      "ath": 2005,
      "acher": 2006,
      "ĠInd": 2007,
      "over": 2008,
      "Ġreceive": 2009,
      "Ġshown": 2010,
      "closed": 2011,
      "}$,": 2012,
      "Ġ260": 2013,
      "sec": 2014,
      "Ġgre": 2015,
      "Ġour": 2016,
      "Ġnormal": 2017,
      "implies": 2018,
      "wise": 2019,
      "}}^{": 2020,
      "Ġteacher": 2021,
      "omm": 2022,
      "Ġtheorem": 2023,
      "{-": 2024,
      "cdots": 2025,
      "+{": 2026,
      "hod": 2027,
      "160": 2028,
      "ĠMapping": 2029,
      "As": 2030,
      "Ġclass": 2031,
      "Ġpartic": 2032,
      "Ġ285": 2033,
      "Ġcalcul": 2034,
      "ilon": 2035,
      "Ġ148": 2036,
      "Ġproof": 2037,
      "Ġ146": 2038,
      "Ġrepresent": 2039,
      "Ġvariables": 2040,
      "Ġlook": 2041,
      "Ġ139": 2042,
      "ĠVector": 2043,
      "Ġcoordin": 2044,
      "Ġ145": 2045,
      "Ġpacked": 2046,
      "Ġ312": 2047,
      "108": 2048,
      "closedint": 2049,
      "Ġcho": 2050,
      "Ġide": 2051,
      "Ġ340": 2052,
      "psilon": 2053,
      "min": 2054,
      "utative": 2055,
      "Ġderiv": 2056,
      "infty": 2057,
      "Ġsubgroup": 2058,
      "Ġfour": 2059,
      "Ġ215": 2060,
      "ented": 2061,
      "tan": 2062,
      "ĠUse": 2063,
      "Ġlike": 2064,
      "ick": 2065,
      "Ġradi": 2066,
      "Ġstatement": 2067,
      "partial": 2068,
      "Since": 2069,
      "istic": 2070,
      "Ġrandom": 2071,
      "Ġeither": 2072,
      "eter": 2073,
      "ann": 2074,
      "Ġabove": 2075,
      "denti": 2076,
      "Ġ315": 2077,
      "Ġq": 2078,
      "rol": 2079,
      "Ġcomplete": 2080,
      "Ġpossible": 2081,
      "Ġ+,": 2082,
      "Ġ380": 2083,
      "Ġtable": 2084,
      "*(*": 2085,
      "Ġsay": 2086,
      "hema": 2087,
      "ĠNorm": 2088,
      "Ġspec": 2089,
      "Ġbounded": 2090,
      "angent": 2091,
      "Ġ306": 2092,
      "Ġgeneral": 2093,
      "Ġless": 2094,
      "Ġend": 2095,
      "Ġ400": 2096,
      "Ġ272": 2097,
      "Ġ304": 2098,
      "ually": 2099,
      "ures": 2100,
      "ose": 2101,
      "ĠProblem": 2102,
      "*,": 2103,
      "put": 2104,
      "old": 2105,
      "Ġinverse": 2106,
      "ĠIs": 2107,
      "ĠLinear": 2108,
      "rictly": 2109,
      "Ġ213": 2110,
      "tern": 2111,
      "Ġ142": 2112,
      "To": 2113,
      "etry": 2114,
      "300": 2115,
      "Ġbecause": 2116,
      "Ġ219": 2117,
      "Ġ221": 2118,
      "otes": 2119,
      "ĠRing": 2120,
      "arr": 2121,
      "rection": 2122,
      "space": 2123,
      "Ġ319": 2124,
      "Ġhypot": 2125,
      "sel": 2126,
      "Ġstraight": 2127,
      "Ġ141": 2128,
      "ilar": 2129,
      "Ġnegative": 2130,
      "Ġobject": 2131,
      "Ġ342": 2132,
      "ality": 2133,
      "epsilon": 2134,
      "xy": 2135,
      "ĠPar": 2136,
      "Ġdistance": 2137,
      "Ġ266": 2138,
      "Ġperc": 2139,
      "Ġ238": 2140,
      "raw": 2141,
      "ĠCondition": 2142,
      "Ġsho": 2143,
      "rinci": 2144,
      "GF": 2145,
      "Ġsmalle": 2146,
      "Ġ520": 2147,
      "Ġ323": 2148,
      "240": 2149,
      "Ġ169": 2150,
      "ucture": 2151,
      "Ġ225": 2152,
      "Ġ247": 2153,
      "Ġdecimal": 2154,
      "agon": 2155,
      "Ġrate": 2156,
      "Ġ196": 2157,
      "Ġes": 2158,
      "axis": 2159,
      "}.": 2160,
      "Ġtopology": 2161,
      "]{": 2162,
      "Ġ212": 2163,
      "}-{": 2164,
      "operator": 2165,
      "Ġleast": 2166,
      "Ġsatis": 2167,
      "operatorname": 2168,
      "*)": 2169,
      "Ġdetermine": 2170,
      "inter": 2171,
      "cess": 2172,
      "Ġ214": 2173,
      "Ġcy": 2174,
      "âĪŀ}{": 2175,
      "olute": 2176,
      "not": 2177,
      "ĠSquare": 2178,
      "inomial": 2179,
      "Ġ324": 2180,
      "Ġjust": 2181,
      "Ġcenter": 2182,
      "'$": 2183,
      "Exercise": 2184,
      "Ġ720": 2185,
      "Ġbeen": 2186,
      "Ġop": 2187,
      "Ġincre": 2188,
      "Ġ264": 2189,
      "Ġconf": 2190,
      "acter": 2191,
      "Ġ211": 2192,
      "Ġ217": 2193,
      "osure": 2194,
      "Ġ149": 2195,
      "aw": 2196,
      "mod": 2197,
      "Ġmon": 2198,
      "Ġalgebraic": 2199,
      ")}{": 2200,
      "crib": 2201,
      "Ġbasis": 2202,
      "Re": 2203,
      "Ġ189": 2204,
      "Ġ416": 2205,
      "Ġ218": 2206,
      "Ġ418": 2207,
      "solute": 2208,
      "ĠAs": 2209,
      "Ġ513": 2210,
      "_{>": 2211,
      "by": 2212,
      "Ġ155": 2213,
      "Ġinfinite": 2214,
      "asing": 2215,
      "Ġcoef": 2216,
      "Ġsign": 2217,
      "Ġnotation": 2218,
      "Ġvectors": 2219,
      "Ġ510": 2220,
      "Ġcons": 2221,
      "ĠProperty": 2222,
      "}}_{": 2223,
      "ĠSum": 2224,
      "Ġ161": 2225,
      "rary": 2226,
      "urable": 2227,
      "Ġrect": 2228,
      "Ġ430": 2229,
      "Ġnext": 2230,
      "Ġ415": 2231,
      "Ġ414": 2232,
      "Ġrec": 2233,
      "200": 2234,
      "hesis": 2235,
      "col": 2236,
      "126": 2237,
      "Ġ256": 2238,
      "tersection": 2239,
      "How": 2240,
      "hline": 2241,
      "Ġ516": 2242,
      "metric": 2243,
      "Ġ413": 2244,
      "rees": 2245,
      "LL": 2246,
      "tesian": 2247,
      "ror": 2248,
      "Ġ480": 2249,
      "ĠSubset": 2250,
      "An": 2251,
      "Ġslope": 2252,
      "Ġac": 2253,
      "Ġ316": 2254,
      "Ġpres": 2255,
      "Ġem": 2256,
      "hn": 2257,
      "ectively": 2258,
      "comp": 2259,
      "Ġfeet": 2260,
      "Ġev": 2261,
      ")-": 2262,
      "ounded": 2263,
      "Ġshould": 2264,
      "face": 2265,
      "Ġhere": 2266,
      "Ġcurve": 2267,
      "lary": 2268,
      "array": 2269,
      "cal": 2270,
      "Ġwhe": 2271,
      "Ġ624": 2272,
      "ĠClosed": 2273,
      "ors": 2274,
      "Ġ518": 2275,
      "ategory": 2276,
      "Ġ336": 2277,
      "rollary": 2278,
      "Ġiff": 2279,
      "ĠCo": 2280,
      "Ġlines": 2281,
      "Ġ164": 2282,
      "BC": 2283,
      "Ġins": 2284,
      "Ġbase": 2285,
      "Ġ616": 2286,
      "Ġindependent": 2287,
      "add": 2288,
      "ĠMe": 2289,
      "attice": 2290,
      "Ġnecess": 2291,
      "ources": 2292,
      "Ġsem": 2293,
      "bitrary": 2294,
      "Ġ310": 2295,
      "ĠGraph": 2296,
      "Ġ159": 2297,
      "tices": 2298,
      "Ġmetric": 2299,
      "lect": 2300,
      "Ġ936": 2301,
      "rime": 2302,
      "aracter": 2303,
      "Ġ317": 2304,
      "crete": 2305,
      "Ġ158": 2306,
      "Ġ318": 2307,
      "Ġ${(": 2308,
      "tens": 2309,
      "Ġquad": 2310,
      "Ġu": 2311,
      "dinal": 2312,
      "iles": 2313,
      "112": 2314,
      "Ġ816": 2315,
      "ense": 2316,
      "Ġ174": 2317,
      "Ġques": 2318,
      "Ġcompact": 2319,
      "ĠIt": 2320,
      "Ġnatural": 2321,
      "}^{âĪĴ": 2322,
      "Ġ810": 2323,
      "Ġed": 2324,
      "ĠSequence": 2325,
      "Ġ313": 2326,
      "Ġ175": 2327,
      "ĠâĵĴ": 2328,
      "cup": 2329,
      "ible": 2330,
      "Ġ172": 2331,
      "Some": 2332,
      "ĠâĢ": 2333,
      "Ġ820": 2334,
      "ron": 2335,
      "Ġ151": 2336,
      "Ġsolutions": 2337,
      "Ġ517": 2338,
      "ell": 2339,
      "Ġ330": 2340,
      "oid": 2341,
      "Ġ730": 2342,
      "Ġ519": 2343,
      "Ġ819": 2344,
      "Ġ924": 2345,
      "position": 2346,
      "cap": 2347,
      "ĠEr": 2348,
      "bor": 2349,
      "ucl": 2350,
      "dots": 2351,
      "ish": 2352,
      "Ġra": 2353,
      "Ġapproxim": 2354,
      "ĠIdenti": 2355,
      "otice": 2356,
      "Ġwri": 2357,
      "alf": 2358,
      "Ġexp": 2359,
      "ĠPoint": 2360,
      "Ġwell": 2361,
      "Ġfact": 2362,
      "ĠInter": 2363,
      "Ġ184": 2364,
      "Ġ612": 2365,
      "Ġdenotes": 2366,
      "tics": 2367,
      "ĠOpen": 2368,
      "Ġoperation": 2369,
      "angular": 2370,
      "Now": 2371,
      "Ġparticular": 2372,
      "Ġ314": 2373,
      "^*": 2374,
      "Ġ410": 2375,
      "Ġ163": 2376,
      "ĠEquivalen": 2377,
      "Ġmaxim": 2378,
      "get": 2379,
      "Use": 2380,
      "ions": 2381,
      "Ġmethod": 2382,
      "Ġ450": 2383,
      "ĠContinuous": 2384,
      "--": 2385,
      "Ġ417": 2386,
      "Ġ511": 2387,
      "Ġ500": 2388,
      "nt": 2389,
      "Ġ207": 2390,
      "Ġ910": 2391,
      "Ġ178": 2392,
      "Ġmathema": 2393,
      "ype": 2394,
      "Ġ504": 2395,
      "Ġsince": 2396,
      "Ġradius": 2397,
      "Ġ913": 2398,
      "Ġ157": 2399,
      "Therefore": 2400,
      "stitute": 2401,
      "Ġdevi": 2402,
      "),$": 2403,
      "ĠConver": 2404,
      "Ġdisc": 2405,
      "=\"": 2406,
      "Ġ920": 2407,
      "Ġseen": 2408,
      "cepts": 2409,
      "Ġspaces": 2410,
      "Ġ918": 2411,
      "Ġ919": 2412,
      "rho": 2413,
      "}}{{": 2414,
      "Ġ619": 2415,
      "Ġ412": 2416,
      "ĠPower": 2417,
      "Ġ817": 2418,
      "Ġ540": 2419,
      "lt": 2420,
      "rith": 2421,
      "Ġ231": 2422,
      "ton": 2423,
      "}^{âĢ²}(": 2424,
      "Consider": 2425,
      "Ġpercent": 2426,
      "Ġfactors": 2427,
      "Ġrespectively": 2428,
      "Ġ615": 2429,
      "Ġ617": 2430,
      "Ġ512": 2431,
      "Ġ524": 2432,
      "Ġcheck": 2433,
      "Ġprim": 2434,
